app/controllers/dramas_controller.rb

SELECT "dramas".* FROM "dramas" ORDER BY "dramas"."created_at" DESC
---
  def index
    unless (params[:category]).nil? then
      @title = "海外ドラマ：#{getCategoryName}"
      @dramas = Drama.where(category: params[:category])
    else
      @title = "話題のドラマ"
      @dramas = Drama.all

SELECT  "dramas".* FROM "dramas" WHERE "dramas"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @drama = Drama.find(params[:id])